templates/system/functions/ports
/*--------------------------------*- C++ -*----------------------------------*\
| Mass balance at the ports -- CLAUDE.md 9.4                                   |
|                                                                              |
| "inlet flux + outlet flux ~ 0. This catches bad BC pairings faster than       |
|  anything else." Watch log.solve / postProcessing/ for these two summing to   |
|  zero. If they do not, stop and fix the BCs -- nothing downstream is valid.   |
|                                                                              |
| Target at Q = 5 m3/h:  |phi| = 1.3889e-3 m3/s (simpleFoam, volumetric)        |
|                        |phi| = 1.667e-3 kg/s  (buoyantSimpleFoam, mass)       |
\*---------------------------------------------------------------------------*/

inletFlux
{
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    writeControl    timeStep;
    writeInterval   20;
    log             true;
    writeFields     false;
    regionType      patch;
    name            inlet;
    operation       sum;
    fields          (phi);
}

outletFlux
{
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    writeControl    timeStep;
    writeInterval   20;
    log             true;
    writeFields     false;
    regionType      patch;
    name            outlet;
    operation       sum;
    fields          (phi);
}

// Area-averaged outlet velocity -- sanity check against Q / A_port.
outletU
{
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    writeControl    timeStep;
    writeInterval   20;
    log             false;
    writeFields     false;
    regionType      patch;
    name            outlet;
    operation       areaAverage;
    fields          (U);
}

// How much air actually goes down the 2.5 mm tray side slots (CLAUDE.md 7)?
// This is a RESULT, not an assumption. If it comes out below ~1 % of Q, the
// level-2 slot refinement can be dropped at m3 and the study gets cheaper.
traySlotFlux
{
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    writeControl    writeTime;
    log             true;
    writeFields     false;
    regionType      sampledSurface;
    name            slotPlane;
    sampledSurfaceDict
    {
        type        plane;
        planeType   pointAndNormal;
        pointAndNormalDict
        {
            point   (0 0.0933 0.0125);   // mid-depth, mid-slot-height
            normal  (0 1 0);
        }
        // restrict to the two slots: x outside the tray footprint, z below its top
        bounds      (-1 -1 -1) (1 1 0.025);
        interpolate true;
    }
    operation       sum;
    fields          (phi);
}

// ************************************************************************* //
